RT-Thread/rt-thread/bsp/apollo2/libraries/drivers/regs/am_reg_gpio.h
// Pad 3 high order drive strength selection.  Used in conjunction with
// PAD3STRNG field to set the pad drive strength.
#define AM_REG_GPIO_ALTPADCFGA_PAD3_DS1_S            24
#define AM_REG_GPIO_ALTPADCFGA_PAD3_DS1_M            0x01000000
#define AM_REG_GPIO_ALTPADCFGA_PAD3_DS1(n)           (((uint32_t)(n) << 24) & 0x01000000)

// Pad 2 slew rate selection.
#define AM_REG_GPIO_ALTPADCFGA_PAD2_SR_S             20
#define AM_REG_GPIO_ALTPADCFGA_PAD2_SR_M             0x00100000
#define AM_REG_GPIO_ALTPADCFGA_PAD2_SR(n)            (((uint32_t)(n) << 20) & 0x00100000)
#define AM_REG_GPIO_ALTPADCFGA_PAD2_SR_SR_EN         0x00100000

// Pad 2 high order drive strength selection.  Used in conjunction with
// PAD2STRNG field to set the pad drive strength.
#define AM_REG_GPIO_ALTPADCFGA_PAD2_DS1_S            16
#define AM_REG_GPIO_ALTPADCFGA_PAD2_DS1_M            0x00010000
#define AM_REG_GPIO_ALTPADCFGA_PAD2_DS1(n)           (((uint32_t)(n) << 16) & 0x00010000)

// Pad 1 slew rate selection.
#define AM_REG_GPIO_ALTPADCFGA_PAD1_SR_S             12
#define AM_REG_GPIO_ALTPADCFGA_PAD1_SR_M             0x00001000
#define AM_REG_GPIO_ALTPADCFGA_PAD1_SR(n)            (((uint32_t)(n) << 12) & 0x00001000)
#define AM_REG_GPIO_ALTPADCFGA_PAD1_SR_SR_EN         0x00001000

// Pad 1 high order drive strength selection.  Used in conjunction with
// PAD1STRNG field to set the pad drive strength.
#define AM_REG_GPIO_ALTPADCFGA_PAD1_DS1_S            8
#define AM_REG_GPIO_ALTPADCFGA_PAD1_DS1_M            0x00000100
#define AM_REG_GPIO_ALTPADCFGA_PAD1_DS1(n)           (((uint32_t)(n) << 8) & 0x00000100)

// Pad 0 slew rate selection.
#define AM_REG_GPIO_ALTPADCFGA_PAD0_SR_S             4
#define AM_REG_GPIO_ALTPADCFGA_PAD0_SR_M             0x00000010
#define AM_REG_GPIO_ALTPADCFGA_PAD0_SR(n)            (((uint32_t)(n) << 4) & 0x00000010)
#define AM_REG_GPIO_ALTPADCFGA_PAD0_SR_SR_EN         0x00000010

// Pad 0 high order drive strength selection.  Used in conjunction with
// PAD0STRNG field to set the pad drive strength.
#define AM_REG_GPIO_ALTPADCFGA_PAD0_DS1_S            0
#define AM_REG_GPIO_ALTPADCFGA_PAD0_DS1_M            0x00000001
#define AM_REG_GPIO_ALTPADCFGA_PAD0_DS1(n)           (((uint32_t)(n) << 0) & 0x00000001)

//*****************************************************************************
//
// GPIO_ALTPADCFGB - Alternate Pad Configuration reg1 (Pads 7,6,5,4)
//
//*****************************************************************************
// Pad 7 slew rate selection.
#define AM_REG_GPIO_ALTPADCFGB_PAD7_SR_S             28
#define AM_REG_GPIO_ALTPADCFGB_PAD7_SR_M             0x10000000
#define AM_REG_GPIO_ALTPADCFGB_PAD7_SR(n)            (((uint32_t)(n) << 28) & 0x10000000)
#define AM_REG_GPIO_ALTPADCFGB_PAD7_SR_SR_EN         0x10000000

// Pad 7 high order drive strength selection.  Used in conjunction with
// PAD7STRNG field to set the pad drive strength.
#define AM_REG_GPIO_ALTPADCFGB_PAD7_DS1_S            24
#define AM_REG_GPIO_ALTPADCFGB_PAD7_DS1_M            0x01000000
#define AM_REG_GPIO_ALTPADCFGB_PAD7_DS1(n)           (((uint32_t)(n) << 24) & 0x01000000)

// Pad 6 slew rate selection.
#define AM_REG_GPIO_ALTPADCFGB_PAD6_SR_S             20
#define AM_REG_GPIO_ALTPADCFGB_PAD6_SR_M             0x00100000
#define AM_REG_GPIO_ALTPADCFGB_PAD6_SR(n)            (((uint32_t)(n) << 20) & 0x00100000)
#define AM_REG_GPIO_ALTPADCFGB_PAD6_SR_SR_EN         0x00100000

// Pad 6 high order drive strength selection.  Used in conjunction with
// PAD6STRNG field to set the pad drive strength.
#define AM_REG_GPIO_ALTPADCFGB_PAD6_DS1_S            16
#define AM_REG_GPIO_ALTPADCFGB_PAD6_DS1_M            0x00010000
#define AM_REG_GPIO_ALTPADCFGB_PAD6_DS1(n)           (((uint32_t)(n) << 16) & 0x00010000)

// Pad 5 slew rate selection.
#define AM_REG_GPIO_ALTPADCFGB_PAD5_SR_S             12
#define AM_REG_GPIO_ALTPADCFGB_PAD5_SR_M             0x00001000
#define AM_REG_GPIO_ALTPADCFGB_PAD5_SR(n)            (((uint32_t)(n) << 12) & 0x00001000)
#define AM_REG_GPIO_ALTPADCFGB_PAD5_SR_SR_EN         0x00001000

// Pad 5 high order drive strength selection.  Used in conjunction with
// PAD5STRNG field to set the pad drive strength.
#define AM_REG_GPIO_ALTPADCFGB_PAD5_DS1_S            8
#define AM_REG_GPIO_ALTPADCFGB_PAD5_DS1_M            0x00000100
#define AM_REG_GPIO_ALTPADCFGB_PAD5_DS1(n)           (((uint32_t)(n) << 8) & 0x00000100)

// Pad 4 slew rate selection.
#define AM_REG_GPIO_ALTPADCFGB_PAD4_SR_S             4
#define AM_REG_GPIO_ALTPADCFGB_PAD4_SR_M             0x00000010
#define AM_REG_GPIO_ALTPADCFGB_PAD4_SR(n)            (((uint32_t)(n) << 4) & 0x00000010)
#define AM_REG_GPIO_ALTPADCFGB_PAD4_SR_SR_EN         0x00000010

// Pad 4 high order drive strength selection.  Used in conjunction with
// PAD4STRNG field to set the pad drive strength.
#define AM_REG_GPIO_ALTPADCFGB_PAD4_DS1_S            0
#define AM_REG_GPIO_ALTPADCFGB_PAD4_DS1_M            0x00000001
#define AM_REG_GPIO_ALTPADCFGB_PAD4_DS1(n)           (((uint32_t)(n) << 0) & 0x00000001)

//*****************************************************************************
//
// GPIO_ALTPADCFGC - Alternate Pad Configuration reg2 (Pads 11,10,9,8)
//
//*****************************************************************************
// Pad 11 slew rate selection.
#define AM_REG_GPIO_ALTPADCFGC_PAD11_SR_S            28
#define AM_REG_GPIO_ALTPADCFGC_PAD11_SR_M            0x10000000
#define AM_REG_GPIO_ALTPADCFGC_PAD11_SR(n)           (((uint32_t)(n) << 28) & 0x10000000)
#define AM_REG_GPIO_ALTPADCFGC_PAD11_SR_SR_EN        0x10000000

// Pad 11 high order drive strength selection.  Used in conjunction with
// PAD11STRNG field to set the pad drive strength.
#define AM_REG_GPIO_ALTPADCFGC_PAD11_DS1_S           24
#define AM_REG_GPIO_ALTPADCFGC_PAD11_DS1_M           0x01000000
#define AM_REG_GPIO_ALTPADCFGC_PAD11_DS1(n)          (((uint32_t)(n) << 24) & 0x01000000)

// Pad 10 slew rate selection.
#define AM_REG_GPIO_ALTPADCFGC_PAD10_SR_S            20
#define AM_REG_GPIO_ALTPADCFGC_PAD10_SR_M            0x00100000
#define AM_REG_GPIO_ALTPADCFGC_PAD10_SR(n)           (((uint32_t)(n) << 20) & 0x00100000)
#define AM_REG_GPIO_ALTPADCFGC_PAD10_SR_SR_EN        0x00100000

// Pad 10 high order drive strength selection.  Used in conjunction with
// PAD10STRNG field to set the pad drive strength.
#define AM_REG_GPIO_ALTPADCFGC_PAD10_DS1_S           16
#define AM_REG_GPIO_ALTPADCFGC_PAD10_DS1_M           0x00010000
#define AM_REG_GPIO_ALTPADCFGC_PAD10_DS1(n)          (((uint32_t)(n) << 16) & 0x00010000)

// Pad 9 slew rate selection.
#define AM_REG_GPIO_ALTPADCFGC_PAD9_SR_S             12
#define AM_REG_GPIO_ALTPADCFGC_PAD9_SR_M             0x00001000
#define AM_REG_GPIO_ALTPADCFGC_PAD9_SR(n)            (((uint32_t)(n) << 12) & 0x00001000)
#define AM_REG_GPIO_ALTPADCFGC_PAD9_SR_SR_EN         0x00001000

// Pad 9 high order drive strength selection.  Used in conjunction with
// PAD9STRNG field to set the pad drive strength.
#define AM_REG_GPIO_ALTPADCFGC_PAD9_DS1_S            8
#define AM_REG_GPIO_ALTPADCFGC_PAD9_DS1_M            0x00000100
#define AM_REG_GPIO_ALTPADCFGC_PAD9_DS1(n)           (((uint32_t)(n) << 8) & 0x00000100)

// Pad 8 slew rate selection.
#define AM_REG_GPIO_ALTPADCFGC_PAD8_SR_S             4
#define AM_REG_GPIO_ALTPADCFGC_PAD8_SR_M             0x00000010
#define AM_REG_GPIO_ALTPADCFGC_PAD8_SR(n)            (((uint32_t)(n) << 4) & 0x00000010)
#define AM_REG_GPIO_ALTPADCFGC_PAD8_SR_SR_EN         0x00000010

