RT-Thread/rt-thread/bsp/apollo2/libraries/drivers/regs/am_reg_gpio.h
// Pad 8 high order drive strength selection.  Used in conjunction with
// PAD8STRNG field to set the pad drive strength.
#define AM_REG_GPIO_ALTPADCFGC_PAD8_DS1_S            0
#define AM_REG_GPIO_ALTPADCFGC_PAD8_DS1_M            0x00000001
#define AM_REG_GPIO_ALTPADCFGC_PAD8_DS1(n)           (((uint32_t)(n) << 0) & 0x00000001)

//*****************************************************************************
//
// GPIO_ALTPADCFGD - Alternate Pad Configuration reg3 (Pads 15,14,13,12)
//
//*****************************************************************************
// Pad 15 slew rate selection.
#define AM_REG_GPIO_ALTPADCFGD_PAD15_SR_S            28
#define AM_REG_GPIO_ALTPADCFGD_PAD15_SR_M            0x10000000
#define AM_REG_GPIO_ALTPADCFGD_PAD15_SR(n)           (((uint32_t)(n) << 28) & 0x10000000)
#define AM_REG_GPIO_ALTPADCFGD_PAD15_SR_SR_EN        0x10000000

// Pad 15 high order drive strength selection.  Used in conjunction with
// PAD15STRNG field to set the pad drive strength.
#define AM_REG_GPIO_ALTPADCFGD_PAD15_DS1_S           24
#define AM_REG_GPIO_ALTPADCFGD_PAD15_DS1_M           0x01000000
#define AM_REG_GPIO_ALTPADCFGD_PAD15_DS1(n)          (((uint32_t)(n) << 24) & 0x01000000)

// Pad 14 slew rate selection.
#define AM_REG_GPIO_ALTPADCFGD_PAD14_SR_S            20
#define AM_REG_GPIO_ALTPADCFGD_PAD14_SR_M            0x00100000
#define AM_REG_GPIO_ALTPADCFGD_PAD14_SR(n)           (((uint32_t)(n) << 20) & 0x00100000)
#define AM_REG_GPIO_ALTPADCFGD_PAD14_SR_SR_EN        0x00100000

// Pad 14 high order drive strength selection.  Used in conjunction with
// PAD14STRNG field to set the pad drive strength.
#define AM_REG_GPIO_ALTPADCFGD_PAD14_DS1_S           16
#define AM_REG_GPIO_ALTPADCFGD_PAD14_DS1_M           0x00010000
#define AM_REG_GPIO_ALTPADCFGD_PAD14_DS1(n)          (((uint32_t)(n) << 16) & 0x00010000)

// Pad 13 slew rate selection.
#define AM_REG_GPIO_ALTPADCFGD_PAD13_SR_S            12
#define AM_REG_GPIO_ALTPADCFGD_PAD13_SR_M            0x00001000
#define AM_REG_GPIO_ALTPADCFGD_PAD13_SR(n)           (((uint32_t)(n) << 12) & 0x00001000)
#define AM_REG_GPIO_ALTPADCFGD_PAD13_SR_SR_EN        0x00001000

// Pad 13 high order drive strength selection.  Used in conjunction with
// PAD13STRNG field to set the pad drive strength.
#define AM_REG_GPIO_ALTPADCFGD_PAD13_DS1_S           8
#define AM_REG_GPIO_ALTPADCFGD_PAD13_DS1_M           0x00000100
#define AM_REG_GPIO_ALTPADCFGD_PAD13_DS1(n)          (((uint32_t)(n) << 8) & 0x00000100)

// Pad 12 slew rate selection.
#define AM_REG_GPIO_ALTPADCFGD_PAD12_SR_S            4
#define AM_REG_GPIO_ALTPADCFGD_PAD12_SR_M            0x00000010
#define AM_REG_GPIO_ALTPADCFGD_PAD12_SR(n)           (((uint32_t)(n) << 4) & 0x00000010)
#define AM_REG_GPIO_ALTPADCFGD_PAD12_SR_SR_EN        0x00000010

// Pad 12 high order drive strength selection.  Used in conjunction with
// PAD12STRNG field to set the pad drive strength.
#define AM_REG_GPIO_ALTPADCFGD_PAD12_DS1_S           0
#define AM_REG_GPIO_ALTPADCFGD_PAD12_DS1_M           0x00000001
#define AM_REG_GPIO_ALTPADCFGD_PAD12_DS1(n)          (((uint32_t)(n) << 0) & 0x00000001)

//*****************************************************************************
//
// GPIO_ALTPADCFGE - Alternate Pad Configuration reg4 (Pads 19,18,17,16)
//
//*****************************************************************************
// Pad 19 slew rate selection.
#define AM_REG_GPIO_ALTPADCFGE_PAD19_SR_S            28
#define AM_REG_GPIO_ALTPADCFGE_PAD19_SR_M            0x10000000
#define AM_REG_GPIO_ALTPADCFGE_PAD19_SR(n)           (((uint32_t)(n) << 28) & 0x10000000)
#define AM_REG_GPIO_ALTPADCFGE_PAD19_SR_SR_EN        0x10000000

// Pad 19 high order drive strength selection.  Used in conjunction with
// PAD19STRNG field to set the pad drive strength.
#define AM_REG_GPIO_ALTPADCFGE_PAD19_DS1_S           24
#define AM_REG_GPIO_ALTPADCFGE_PAD19_DS1_M           0x01000000
#define AM_REG_GPIO_ALTPADCFGE_PAD19_DS1(n)          (((uint32_t)(n) << 24) & 0x01000000)

// Pad 18 slew rate selection.
#define AM_REG_GPIO_ALTPADCFGE_PAD18_SR_S            20
#define AM_REG_GPIO_ALTPADCFGE_PAD18_SR_M            0x00100000
#define AM_REG_GPIO_ALTPADCFGE_PAD18_SR(n)           (((uint32_t)(n) << 20) & 0x00100000)
#define AM_REG_GPIO_ALTPADCFGE_PAD18_SR_SR_EN        0x00100000

// Pad 18 high order drive strength selection.  Used in conjunction with
// PAD18STRNG field to set the pad drive strength.
#define AM_REG_GPIO_ALTPADCFGE_PAD18_DS1_S           16
#define AM_REG_GPIO_ALTPADCFGE_PAD18_DS1_M           0x00010000
#define AM_REG_GPIO_ALTPADCFGE_PAD18_DS1(n)          (((uint32_t)(n) << 16) & 0x00010000)

// Pad 17 slew rate selection.
#define AM_REG_GPIO_ALTPADCFGE_PAD17_SR_S            12
#define AM_REG_GPIO_ALTPADCFGE_PAD17_SR_M            0x00001000
#define AM_REG_GPIO_ALTPADCFGE_PAD17_SR(n)           (((uint32_t)(n) << 12) & 0x00001000)
#define AM_REG_GPIO_ALTPADCFGE_PAD17_SR_SR_EN        0x00001000

// Pad 17 high order drive strength selection.  Used in conjunction with
// PAD17STRNG field to set the pad drive strength.
#define AM_REG_GPIO_ALTPADCFGE_PAD17_DS1_S           8
#define AM_REG_GPIO_ALTPADCFGE_PAD17_DS1_M           0x00000100
#define AM_REG_GPIO_ALTPADCFGE_PAD17_DS1(n)          (((uint32_t)(n) << 8) & 0x00000100)

// Pad 16 slew rate selection.
#define AM_REG_GPIO_ALTPADCFGE_PAD16_SR_S            4
#define AM_REG_GPIO_ALTPADCFGE_PAD16_SR_M            0x00000010
#define AM_REG_GPIO_ALTPADCFGE_PAD16_SR(n)           (((uint32_t)(n) << 4) & 0x00000010)
#define AM_REG_GPIO_ALTPADCFGE_PAD16_SR_SR_EN        0x00000010

// Pad 16 high order drive strength selection.  Used in conjunction with
// PAD16STRNG field to set the pad drive strength.
#define AM_REG_GPIO_ALTPADCFGE_PAD16_DS1_S           0
#define AM_REG_GPIO_ALTPADCFGE_PAD16_DS1_M           0x00000001
#define AM_REG_GPIO_ALTPADCFGE_PAD16_DS1(n)          (((uint32_t)(n) << 0) & 0x00000001)

//*****************************************************************************
//
// GPIO_ALTPADCFGF - Alternate Pad Configuration reg5 (Pads 23,22,21,20)
//
//*****************************************************************************
// Pad 23 slew rate selection.
#define AM_REG_GPIO_ALTPADCFGF_PAD23_SR_S            28
#define AM_REG_GPIO_ALTPADCFGF_PAD23_SR_M            0x10000000
#define AM_REG_GPIO_ALTPADCFGF_PAD23_SR(n)           (((uint32_t)(n) << 28) & 0x10000000)
#define AM_REG_GPIO_ALTPADCFGF_PAD23_SR_SR_EN        0x10000000

// Pad 23 high order drive strength selection.  Used in conjunction with
// PAD23STRNG field to set the pad drive strength.
#define AM_REG_GPIO_ALTPADCFGF_PAD23_DS1_S           24
#define AM_REG_GPIO_ALTPADCFGF_PAD23_DS1_M           0x01000000
#define AM_REG_GPIO_ALTPADCFGF_PAD23_DS1(n)          (((uint32_t)(n) << 24) & 0x01000000)

// Pad 22 slew rate selection.
#define AM_REG_GPIO_ALTPADCFGF_PAD22_SR_S            20
#define AM_REG_GPIO_ALTPADCFGF_PAD22_SR_M            0x00100000
#define AM_REG_GPIO_ALTPADCFGF_PAD22_SR(n)           (((uint32_t)(n) << 20) & 0x00100000)
#define AM_REG_GPIO_ALTPADCFGF_PAD22_SR_SR_EN        0x00100000

// Pad 22 high order drive strength selection.  Used in conjunction with
// PAD22STRNG field to set the pad drive strength.
#define AM_REG_GPIO_ALTPADCFGF_PAD22_DS1_S           16
#define AM_REG_GPIO_ALTPADCFGF_PAD22_DS1_M           0x00010000
#define AM_REG_GPIO_ALTPADCFGF_PAD22_DS1(n)          (((uint32_t)(n) << 16) & 0x00010000)

// Pad 21 slew rate selection.
#define AM_REG_GPIO_ALTPADCFGF_PAD21_SR_S            12
#define AM_REG_GPIO_ALTPADCFGF_PAD21_SR_M            0x00001000
#define AM_REG_GPIO_ALTPADCFGF_PAD21_SR(n)           (((uint32_t)(n) << 12) & 0x00001000)
#define AM_REG_GPIO_ALTPADCFGF_PAD21_SR_SR_EN        0x00001000

