RT-Thread/rt-thread/bsp/apollo2/libraries/drivers/regs/am_reg_gpio.h
// Pad 44 high order drive strength selection.  Used in conjunction with
// PAD44STRNG field to set the pad drive strength.
#define AM_REG_GPIO_ALTPADCFGL_PAD44_DS1_S           0
#define AM_REG_GPIO_ALTPADCFGL_PAD44_DS1_M           0x00000001
#define AM_REG_GPIO_ALTPADCFGL_PAD44_DS1(n)          (((uint32_t)(n) << 0) & 0x00000001)

//*****************************************************************************
//
// GPIO_ALTPADCFGM - Alternate Pad Configuration reg12 (Pads 49,48)
//
//*****************************************************************************
// Pad 49 slew rate selection.
#define AM_REG_GPIO_ALTPADCFGM_PAD49_SR_S            12
#define AM_REG_GPIO_ALTPADCFGM_PAD49_SR_M            0x00001000
#define AM_REG_GPIO_ALTPADCFGM_PAD49_SR(n)           (((uint32_t)(n) << 12) & 0x00001000)
#define AM_REG_GPIO_ALTPADCFGM_PAD49_SR_SR_EN        0x00001000

// Pad 49 high order drive strength selection.  Used in conjunction with
// PAD49STRNG field to set the pad drive strength.
#define AM_REG_GPIO_ALTPADCFGM_PAD49_DS1_S           8
#define AM_REG_GPIO_ALTPADCFGM_PAD49_DS1_M           0x00000100
#define AM_REG_GPIO_ALTPADCFGM_PAD49_DS1(n)          (((uint32_t)(n) << 8) & 0x00000100)

// Pad 48 slew rate selection.
#define AM_REG_GPIO_ALTPADCFGM_PAD48_SR_S            4
#define AM_REG_GPIO_ALTPADCFGM_PAD48_SR_M            0x00000010
#define AM_REG_GPIO_ALTPADCFGM_PAD48_SR(n)           (((uint32_t)(n) << 4) & 0x00000010)
#define AM_REG_GPIO_ALTPADCFGM_PAD48_SR_SR_EN        0x00000010

// Pad 48 high order drive strength selection.  Used in conjunction with
// PAD48STRNG field to set the pad drive strength.
#define AM_REG_GPIO_ALTPADCFGM_PAD48_DS1_S           0
#define AM_REG_GPIO_ALTPADCFGM_PAD48_DS1_M           0x00000001
#define AM_REG_GPIO_ALTPADCFGM_PAD48_DS1(n)          (((uint32_t)(n) << 0) & 0x00000001)

#endif // AM_REG_GPIO_H
